<a href="https://colab.research.google.com/github/eumoas/Data-Engineer/blob/main/CRUD_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#INSTALAR UMA BIBLIOTECA DE CONEXÃO PYTHON COM O MYSQL
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.28-cp37-cp37m-manylinux1_x86_64.whl (37.6 MB)
     |████████████████████████████████| 37.6 MB 450 kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.28

In [ ]:
#IMPORTAR AS BIBLIOTECAS DE CONEXÃO
import mysql.connector
from mysql.connector import Error

In [ ]:
#ESTABELECER UMA CONEXÃO COM O BANCO DE DADOS ESCOLHIDO (escola)
def conexao_db(host, user, password, db):
  conexao = None
  try:
    conexao = mysql.connector.connect(
      host = host,
      user = user,
      passwd = password,
      database = db     
    )
    print(f"Conexão com o banco {db} realizada com Sucesso!")
  except:
    print(f"Erro ao conectar ao banco {db}! '{Error}'")

  return conexao
#retornar um objeto de conexão

In [ ]:
#CRIA UM OBJETO DE CONEXÃO COM O BANCO CHAMADO conexao
conexao = conexao_db("35.222.95.119", "root", "123456", "escola")

Conexão com o banco escola realizada com Sucesso!

In [ ]:
#CRIAR UMA FUNÇÃO PARA EXECUTAR INSERT, UPDATE, DELETE (Também seria possível
# executar os comandos DDL)
def executar_query(conexao, sql):
  cursor = conexao.cursor()
  try:
    cursor.execute(sql)
    conexao.commit()
    print("Query executada com Sucesso!")
  except Error as err:
    print(f"Erro ao executar a query! {err}")

In [ ]:
#CRIAR UMA FUNÇÃO PARA EXECUTAR O SELECT (leitura de dados do Banco de Dados)
def ler_query(conexao, sql):
  cursor = conexao.cursor()
  resultado = None
  try:
    cursor.execute(sql)
    resultado = cursor.fetchall()
    return resultado
  except Error as err:
    print(f"Erro ao listar do banco de dados - '{err}'")

In [ ]:
#CRUD - C CREATE
query = "INSERT INTO alunos VALUES (NULL, 'Marcelo Armando', '297892721', '1111111111', '2222222222', 'Teresópolis', 'RJ', 1)"
executar_query(conexao, query)

Query executada com Sucesso!

In [ ]:
#CRUD - U UPDATE
query = "UPDATE alunos SET matricula_aluno = '333333333' WHERE id_aluno = 21"
executar_query(conexao, query)

Query executada com Sucesso!

In [ ]:
#CRUD - D DELETE
query = "DELETE FROM alunos WHERE id_aluno = 21"
executar_query(conexao, query)

In [ ]:
#CRUD - S SELECT
query = "SELECT * FROM alunos"
lista_alunos = ler_query(conexao, query)

In [ ]:
print(lista_alunos)

[(11, 'Joaquim dos Santos', 'a13738738', '88874333998', '99688877', 'Joinvile', 'SC', 4), (12, 'Júlia Maria de Souza', 'a43534', '99877733377', '372221115', 'Ribeirão Preto', 'SP', 3), (13, 'Carlos Henrique Pereira', 'b1768586', '88800099876', '222555888', 'Curitiba', 'PR', 4), (14, 'Mirella Cristina Hoffmann', 'b13436546', '9998711122', '33310002', 'Manaus', 'AM', 1), (15, 'Felipe Santana da Silva', 'a1878767', '5554563587', '00222588', 'São Luis', 'MA', 2), (16, 'Kátia de Sousa Silva', 'a1886465654', '33335874966', '333477789', 'Florianópolis', 'SC', 1), (17, 'Isabel Ângela Gomes', 'c198984565', '37789987455', '336669998', 'Porto Alegre', 'RS', 2), (18, 'Pedro Henrique Araujo', 'c16543243', '99986533300', '5669988744', 'Salvador', 'BA', 3), (19, 'Keliane de Paula', 'b11110003', '00355588877', '22233355588', 'Teresina', 'PI', 1), (20, 'João Gustavo Costa', '97987897', '33377745632', '23123188161', 'Florianópolis', 'SC', 3), (21, 'Marcelo Armando', '333333333', '1111111111', '2222222222', 'Teresópolis', 'RJ', 1)]

In [ ]:
for alunos in lista_alunos:
  print(alunos)

(11, 'Joaquim dos Santos', 'a13738738', '88874333998', '99688877', 'Joinvile', 'SC', 4)
(12, 'Júlia Maria de Souza', 'a43534', '99877733377', '372221115', 'Ribeirão Preto', 'SP', 3)
(13, 'Carlos Henrique Pereira', 'b1768586', '88800099876', '222555888', 'Curitiba', 'PR', 4)
(14, 'Mirella Cristina Hoffmann', 'b13436546', '9998711122', '33310002', 'Manaus', 'AM', 1)
(15, 'Felipe Santana da Silva', 'a1878767', '5554563587', '00222588', 'São Luis', 'MA', 2)
(16, 'Kátia de Sousa Silva', 'a1886465654', '33335874966', '333477789', 'Florianópolis', 'SC', 1)
(17, 'Isabel Ângela Gomes', 'c198984565', '37789987455', '336669998', 'Porto Alegre', 'RS', 2)
(18, 'Pedro Henrique Araujo', 'c16543243', '99986533300', '5669988744', 'Salvador', 'BA', 3)
(19, 'Keliane de Paula', 'b11110003', '00355588877', '22233355588', 'Teresina', 'PI', 1)
(20, 'João Gustavo Costa', '97987897', '33377745632', '23123188161', 'Florianópolis', 'SC', 3)
(21, 'Marcelo Armando', '333333333', '1111111111', '2222222222', 'Teresópolis', 'RJ', 1)

In [ ]:
import pandas as pd

In [ ]:
colunas = ['id_aluno', 'nome_aluno','matricula_aluno', 'cpf_aluno', 'rg_aluno', 'cidade_aluno', 'estado_aluno', 'id_turma']
df = pd.DataFrame(lista_alunos, columns = colunas)

In [ ]:
df

,id_aluno,nome_aluno,matricula_aluno,cpf_aluno,rg_aluno,cidade_aluno,estado_aluno,id_turma
0,11,Joaquim dos Santos,a13738738,88874333998,99688877,Joinvile,SC,4
1,12,Júlia Maria de Souza,a43534,99877733377,372221115,Ribeirão Preto,SP,3
2,13,Carlos Henrique Pereira,b1768586,88800099876,222555888,Curitiba,PR,4
3,14,Mirella Cristina Hoffmann,b13436546,9998711122,33310002,Manaus,AM,1
4,15,Felipe Santana da Silva,a1878767,5554563587,00222588,São Luis,MA,2
5,16,Kátia de Sousa Silva,a1886465654,33335874966,333477789,Florianópolis,SC,1
6,17,Isabel Ângela Gomes,c198984565,37789987455,336669998,Porto Alegre,RS,2
7,18,Pedro Henrique Araujo,c16543243,99986533300,5669988744,Salvador,BA,3
8,19,Keliane de Paula,b11110003,00355588877,22233355588,Teresina,PI,1
9,20,João Gustavo Costa,97987897,33377745632,23123188161,Florianópolis,SC,3
10,21,Marcelo Armando,333333333,1111111111,2222222222,Teresópolis,RJ,1

1) Liste o nome e cpf dos professores da turma Programador Java, bem como o horário de início e fim das aulas

2) Exiba o código das turmas que o professor Pedro dos Santos leciona

SELECT nome_turma, nome_aluno, cpf_aluno FROM alunos INNER JOIN turmas ON alunos.id_turma = turmas.id_turma

SELECT nome_turma, nome_aluno, cpf_aluno 
FROM alunos INNER JOIN turmas 
ON alunos.id_turma = turmas.id_turma  
WHERE nome_aluno = 'Mirella Cristina Hoffmann'

SELECT p.nome_professor, d.numero_credito
FROM professores p INNER JOIN prof_lecionam_turma pld (aqui o AS foi suprimido, prof_lecionam_turma AS pld)
ON p.id_professor = pld.id_professor
INNER JOIN disciplina d
INNER JOIN disciplinas d ON pld.id_disciplina = d.id_disciplina
d.id_disciplina = 1; (é mais comum usar com o id, mas pode usar o nome tb)